module Mono.Typed.Term.SyntacticValidity where
open import Mono.Untyped.PreTerm
open import Mono.Typed.Term

infix 4 _⊢_

𝕝𝕠𝕠𝕜𝕦𝕡 : ∀ {𝔫} {Γ : Con 𝔫} {A x}
  → (𝕩 : Γ ∋ x ∶ A)
  → (𝔾 : Γ ctx)
  →      𝔾 ⊢ A ∶ U
𝕝𝕠𝕠𝕜𝕦𝕡 𝕫𝕖𝕣𝕠    (𝔾 , 𝔸) = {!!}
𝕝𝕠𝕠𝕜𝕦𝕡 (𝕤𝕦𝕔 𝕩) (𝔾 , 𝔸) = {!!}

mutual
  _⊢_ : ∀ {𝔫} {Γ : Con 𝔫} {A t}
    → (𝔾 : Γ ctx)
    → (𝕥 : 𝔾 ⊢ t ∶ A)
    →      𝔾 ⊢ A ∶ U
  𝔾 ⊢ 𝕌       = 𝕌
  𝔾 ⊢ ℙ𝕚 𝔸 𝔹  = 𝕌
  𝔾 ⊢ 𝕋       = 𝕌
  𝔾 ⊢ 𝕧𝕒𝕣 𝕩   = 𝕝𝕠𝕠𝕜𝕦𝕡 𝕩 𝔾
  𝔾 ⊢ 𝕝𝕒𝕞 𝕥   = ℙ𝕚 _ (𝔾 , _ ⊢ 𝕥)
  𝔾 ⊢ 𝕒𝕡𝕡 𝕥 𝕦 = {!!}
  𝔾 ⊢ 𝕥𝕥      = 𝕋
  𝔾 ⊢ 𝕥 ≫ ℍ   = ∼₂ ℍ

  ∼₁ : ∀ {𝔫} {Γ : Con 𝔫} {𝔾 : Γ ctx} {A t₁ t₂}
    → 𝔾 ⊢ t₁ ∼ t₂ ∶ A
    → 𝔾 ⊢      t₁ ∶ A
  ∼₁ (𝕣𝕖𝕗𝕝  𝕥)       = 𝕥
  ∼₁ (𝕤𝕪𝕞   𝕡)       = ∼₂ 𝕡
  ∼₁ (𝕥𝕣𝕒𝕟𝕤 𝕡 𝕢)     = ∼₁ 𝕡
  ∼₁ (ℙ𝕚-𝕔𝕠𝕟𝕘 ℍ₁ ℍ₂) = ℙ𝕚 _ (∼₁ ℍ₂)
  ∼₁ (𝕝𝕒𝕞-𝕔𝕠𝕟𝕘 𝕡)    = 𝕝𝕒𝕞 (∼₁ 𝕡)
  ∼₁ (𝕒𝕡𝕡-𝕔𝕠𝕟𝕘 𝕡 𝕢)  = {!!}
  ∼₁ (ℙ𝕚-𝕓𝕖𝕥𝕒 𝕥 𝕦)   = {!!}
  ∼₁ (ℙ𝕚-𝕖𝕥𝕒 𝕥)      = {!!}
  ∼₁ (𝕡 ≫ ℍ)         = ∼₁ 𝕡 ≫ ℍ

  ∼₂ : ∀ {𝔫} {Γ : Con 𝔫} {𝔾 : Γ ctx} {A t₁ t₂}
    → 𝔾 ⊢ t₁ ∼ t₂ ∶ A
    → 𝔾 ⊢      t₂ ∶ A
  ∼₂ (𝕣𝕖𝕗𝕝  𝕥)       = {!!}
  ∼₂ (𝕤𝕪𝕞   𝕡)       = {!!}
  ∼₂ (𝕥𝕣𝕒𝕟𝕤 𝕡 𝕢)     = {!!}
  ∼₂ (ℙ𝕚-𝕔𝕠𝕟𝕘 ℍ₁ ℍ₂) = {!!}
  ∼₂ (𝕝𝕒𝕞-𝕔𝕠𝕟𝕘 𝕡)    = {!!}
  ∼₂ (𝕒𝕡𝕡-𝕔𝕠𝕟𝕘 𝕡 𝕢)  = {!!}
  ∼₂ (ℙ𝕚-𝕓𝕖𝕥𝕒 𝕥 𝕦)   = {!!}
  ∼₂ (ℙ𝕚-𝕖𝕥𝕒 𝕥)      = {!!}
  ∼₂ (𝕡 ≫ ℍ)         = {!!}
